/*REXX*/
 SAY '----------------------'
 SAY '- PROGRAMA DE MEDIA  -'
 SAY 'TECLE ENTER'

DSN    = "'SYS2.IVAN.CLIENTES'"
ARQSAI = "'SYS2.IVAN.SAIDA'"

"ALLOC FILE(CLIENTES) DA("DSN") SHR"
"ALLOC FILE(SAIDA)    DA("ARQSAI") LIKE("DSN") NEW"
    "EXECIO * DISKR CLIENTES (STEM LINHAS. FINIS"
    "EXECIO * DISKW SAIDA    (STEM LINHAS. FINIS"

"FREE FILE(CLIENTES SAIDA)"
