/*REXX*/
 SAY '----------------------'
 SAY '- PROGRAMA DE MEDIA  -'
 SAY 'TECLE ENTER'

DSN = 'SYS2.IVAN.CLIENTES'
"ALLOC FILE(CLIENTES) DA('"DSN"') SHR"
  "EXECIO * DISKR CLIENTES (STEM LINHAS."
    DO NUML = 1 TO LINHAS.0
      SAY LINHAS.NUML
    END
  "EXECIO * DISKR CLIENTES (FINIS"
"FREE FILE(CLIENTES)"
