/* REXX */

STRING = 'IVAN RIBEIRO, RH, 1300'
PARSE VAR STRING VAR1 VAR2 VAR3
SAY VAR1 VAR2 VAR3

REG1 = 'SILVIO SANTOS; SBT; CANAL 12'
REG2 = 'BONINHO; GLOBO; CANAL 10'
PARSE VAR REG1 VAR1 ';' VAR2 ';' VAR3
SAY VAR1 '-' VAR2 '-' VAR3
PARSE VAR REG2 VAR1 ';' VAR2 ';' VAR3
SAY VAR1 '-' VAR2 '-' VAR3
